Public Attributes | List of all members
API_DrawingType Struct Reference
Element Manager API
Represents a drawing element. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Elem_Head  | head
General element header.
char  | name [256]
Custom drawing name if nameType is set to APIName_CustomName.
API_NameTypeValues  | nameType
Type of the drawing name (see API_NameTypeValues).
API_NumberingTypeValues  | numberingType
Numbering options (see API_NumberingTypeValues).
char  | customNumber [256]
Custom drawing number if numberingType is set to APINumbering_CustomNum.
bool  | isInNumbering
The drawing is included in the numbering sequence.
bool  | manualUpdate
Updating method: manual or automatic.
bool  | storedInProject
Drawing is stored in the project file - output only.
bool  | isScheduleAdjusted
Internal parameter used by the Interactive Element Schedule add-on - output only.
bool  | isMultiPageDrawing
Drawing is splitted to more layout (page). It can be true when the source is an Interactive Shedule view.
bool  | includeInAutoTextsAndIES
When true, the Scale of this Drawing will be included in "Drawing Scale" and "Original Scale" AutoTexts, in "Drawing Scales" field of Layout type Project Indexes, in "Drawing Scale" field of Drawing type Project Indexes. Include this Drawing in "Drawing Scale", "Magnification" and "Original Scale" AutoTexts.
double  | angle
Angle of the placed drawing in radian.
double  | ratio
Ratio of drawing size and original size.
double  | rasterizeDPI
Rasterize PDF at this dpi.
double  | drawingScale
Scale of the view (e.g. 0.002 for 1:500) - output only.
double  | parentOriginalScale
Parent scale while drawing creation (used in updating image and pdf type drawings) - output only.
API_AnchorID  | anchorPoint
Placement reference by bounding box node (relevant only if not useOwnOrigoAsAnchor).
API_ColorModeValues  | colorMode
Produce B W or grayscale output (see API_ColorModeValues).
API_PenTableUsageModeValues  | penTableUsageMode
Determines which pen table will be used by the drawing (see API_PenTableUsageModeValues)
API_AttributeIndex  | penTableIndex
Index of the pen table to use (if penTableUsageMode is set to APIPenTableUsageMode_UsePenTableIndex.
bool  | useOwnOrigoAsAnchor
Use drawing's own origo as placement reference point.
bool  | isTransparentBk
The background of the drawing should be transparent.
bool  | isCutWithFrame
Drawing is clipped with frame polygon.
bool  | hasBorderLine
Show drawing border?
API_AttributeIndex  | borderLineType
Line type of the border.
short  | borderPen
Pen attribute index of the border.
double  | borderSize
Thickness of the border in 'm'.
API_DrawingTitle  | title
Drawing title.
API_Box  | bounds
Boundary box.
API_Coord  | pos
Coordinate of the placed drawing's origin on the layout.
API_Polygon  | poly
Polygon on the layout: the clip polygon if isCutWithFrame is true else the bounding box in polygon format.
UInt32  | sortIndex
Sort index.
Int32  | linkUId
Not used yet.
API_Guid  | drawingGuid
GUID of the drawing for identification by autotext.
API_Coord  | modelOffset
If isCutWithFrame is true than it is the offset of the model. It will modify also the pos of the drawing.
API_Vector  | offset
If the drawing is clipped with frame polygon offset is equal to pos else the subvector of pos and the coordinate of anchor. Output only parameter.
API_Coord  | pageOffset
Offset of the next page's position, when isMultiPageDrawing set.
UInt32  | pageNumberX
Number of pages in x direction, when isMultiPageDrawing set.
UInt32  | pageNumberY
Number of pages in y direction, when isMultiPageDrawing set.
Detailed Description
Represents a drawing element.
Remarks
Drawing elements can be placed both in the model space (except which come from an internal view) and onto layouts. The 2D elements which appear in the drawing are stored in the drawingData field in the API_ElementMemo. This data structure has been rewritten from scratch; it has very little resemblance to the original data structure in PlotMaker.
Member Data Documentation
◆ anchorPoint
 API_DrawingType::anchorPoint
Placement reference by bounding box node (relevant only if not useOwnOrigoAsAnchor).
◆ angle
 API_DrawingType::angle
Angle of the placed drawing in radian.
◆ borderLineType
 API_DrawingType::borderLineType
Line type of the border.
◆ borderPen
 API_DrawingType::borderPen
Pen attribute index of the border.
◆ borderSize
 API_DrawingType::borderSize
Thickness of the border in 'm'.
◆ bounds
 API_DrawingType::bounds
Boundary box.
◆ colorMode
 API_DrawingType::colorMode
Produce B W or grayscale output (see API_ColorModeValues).
◆ customNumber
 API_DrawingType::customNumber
Custom drawing number if numberingType is set to APINumbering_CustomNum.
◆ drawingGuid
 API_DrawingType::drawingGuid
GUID of the drawing for identification by autotext.
◆ drawingScale
 API_DrawingType::drawingScale
Scale of the view (e.g. 0.002 for 1:500) - output only.
◆ hasBorderLine
 API_DrawingType::hasBorderLine
Show drawing border?
◆ head
 API_DrawingType::head
General element header.
◆ includeInAutoTextsAndIES
 API_DrawingType::includeInAutoTextsAndIES
When true, the Scale of this Drawing will be included in "Drawing Scale" and "Original Scale" AutoTexts, in "Drawing Scales" field of Layout type Project Indexes, in "Drawing Scale" field of Drawing type Project Indexes. Include this Drawing in "Drawing Scale", "Magnification" and "Original Scale" AutoTexts.
◆ isCutWithFrame
 API_DrawingType::isCutWithFrame
Drawing is clipped with frame polygon.
◆ isInNumbering
 API_DrawingType::isInNumbering
The drawing is included in the numbering sequence.
◆ isMultiPageDrawing
 API_DrawingType::isMultiPageDrawing
Drawing is splitted to more layout (page). It can be true when the source is an Interactive Shedule view.
◆ isScheduleAdjusted
 API_DrawingType::isScheduleAdjusted
Internal parameter used by the Interactive Element Schedule add-on - output only.
◆ isTransparentBk
 API_DrawingType::isTransparentBk
The background of the drawing should be transparent.
◆ linkUId
 API_DrawingType::linkUId
Not used yet.
◆ manualUpdate
 API_DrawingType::manualUpdate
Updating method: manual or automatic.
◆ modelOffset
 API_DrawingType::modelOffset
If isCutWithFrame is true than it is the offset of the model. It will modify also the pos of the drawing.
◆ name
 API_DrawingType::name
Custom drawing name if nameType is set to APIName_CustomName.
◆ nameType
 API_DrawingType::nameType
Type of the drawing name (see API_NameTypeValues).
◆ numberingType
 API_DrawingType::numberingType
Numbering options (see API_NumberingTypeValues).
◆ offset
 API_DrawingType::offset
If the drawing is clipped with frame polygon offset is equal to pos else the subvector of pos and the coordinate of anchor. Output only parameter.
◆ pageNumberX
 API_DrawingType::pageNumberX
Number of pages in x direction, when isMultiPageDrawing set.
◆ pageNumberY
 API_DrawingType::pageNumberY
Number of pages in y direction, when isMultiPageDrawing set.
◆ pageOffset
 API_DrawingType::pageOffset
Offset of the next page's position, when isMultiPageDrawing set.
◆ parentOriginalScale
 API_DrawingType::parentOriginalScale
Parent scale while drawing creation (used in updating image and pdf type drawings) - output only.
◆ penTableIndex
 API_DrawingType::penTableIndex
Index of the pen table to use (if penTableUsageMode is set to APIPenTableUsageMode_UsePenTableIndex.
◆ penTableUsageMode
 API_DrawingType::penTableUsageMode
Determines which pen table will be used by the drawing (see API_PenTableUsageModeValues)
◆ poly
 API_DrawingType::poly
Polygon on the layout: the clip polygon if isCutWithFrame is true else the bounding box in polygon format.
◆ pos
 API_DrawingType::pos
Coordinate of the placed drawing's origin on the layout.
◆ rasterizeDPI
 API_DrawingType::rasterizeDPI
Rasterize PDF at this dpi.
◆ ratio
 API_DrawingType::ratio
Ratio of drawing size and original size.
◆ sortIndex
 API_DrawingType::sortIndex
Sort index.
◆ storedInProject
 API_DrawingType::storedInProject
Drawing is stored in the project file - output only.
◆ title
 API_DrawingType::title
Drawing title.
◆ useOwnOrigoAsAnchor
 API_DrawingType::useOwnOrigoAsAnchor
Use drawing's own origo as placement reference point.